runs/snake3d/both_lips/3k30/RANS/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.0;

boundaryField
{
  snake
  {
    type zeroGradient;
  }

  inlet
  {
    type zeroGradient;
  }

  outlet
  {
    type fixedValue;
    value uniform 0;
  }

  bottom
  {
    type symmetryPlane;
  }

  top
  {
    type symmetryPlane;
  }

  front
  {
    type cyclic;
  }

  back
  {
    type cyclic;
  }
}

//****************************************************************************//
